app/controllers/posts_controller.rb

  def index
    @authors = Author.all
    @posts = if !params[:author].blank?
               Post.by_author(params[:author])
             elsif !params[:date].blank?
               params[:date] == 'Today' ? Post.from_today : Post.old_news
             else
               Post.all
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')